# Часть 2. Базовые объектные типы языка Python и работа с ними.
##### Дано двузначное натуральное число. Выведите на экран сумму его цифр.

>- Для примера:

| Ввод   | Результат
---------|----------
|  11    |   2 
|  98    |   17

*Решение:*
```
n = int(input())
s = 0
while n != 0:
    s += n % 10
    n = n // 10
print(s)
```

##### Скорость первого туриста v1 км/ч, скорость второго туриста v2 км/ч. На какое расстояние друг от друга они отойдут через t часов, если будут двигаться в разные стороны. В первой строке скорость 1 туриста, во второй скорость 2 туриста, в третье строке t – количество часов.

>- Для примера:

| Ввод           | Результат
-----------------|----------
|5<br>7<br>2     | &#124;24 
|10<br>12<br>5   | &#124;110

*Решение:*
```
v1 = int(input())
v2 = int(input())
t = int(input())
s = ((v1 * t) + (v2 * t))
print(int(s))
```

##### Длина Московской кольцевой автомобильной дороги — 109 километров. Байкер Вася стартует с нулевого километра МКАД и едет со скоростью v километров в час. На какой отметке он остановится через t часов? Без использования условных операторов эту задачу существенно проще решить языке Python, чем на других языках программирования. Это связано с особенностями реализации целочисленных операций над отрицательными числами.

>- Входные данные

Программа получает на вход значение v и . Если v>0 , то Вася движется в положительном направлении по МКАД, если же значение v<0 , то в отрицательном. (Гарантируется, что исходные числа - целые и находятся в промежутке от -1000 до +1000).
>- Выходные данные
Программа должна вывести целое число от 0 до 108 — номер отметки, на которой остановится Вася.

>- Для примера:

| Ввод           | Результат
-----------------|----------
|60<br>2         | 11 
|-1<br>1         | 108

*Решение:*
```
a = int(input())
b = int(input())
print((a * b) % 109)
```

##### n школьников делят яблок поровну, неделяющийся остаток остается в корзинке. Сколько яблок останется в корзинке?

>- Входные данные

Программа получает на вход числа и - целые, положительные, не превышают 10000.
>- Для примера:

| Ввод           | Результат
-----------------|----------
|3<br>14         | 2 

*Решение:*
```
n = int(input())
k = int(input())
x = k // n
print(k - (x * n))
```

##### Пирожок в столовой стоит a рублей и b копеек. Определите, сколько рублей и копеек нужно заплатить за n пирожков.

>- Входные данные
Программа получает на вход три числа: , , n - целые, положительные, не превышают 10000.
>- Выходные данные
Программа должна вывести два числа: стоимость покупки в рублях и копейках.

>- Для примера:

| Ввод             | Результат
-------------------|----------
|10<br>15<br>2     | 20 30 
|2<br>50<br>4      | 10 0

*Решение:*
```
a = int(input())
b = int(input())
n = int(input())
cost = n * (100 * a + b)
print(cost // 100, cost % 100)
```


















