# Тест. Модули и пакеты.
#### Задача 1. Напишите программу, вычисляющую значение тригонометрического выражения sin ⁡x+cos⁡ x+tan x по заданному числу градусов x.
> Формат входных данных
- На вход программе подается одно вещественное число x измеряемое в градусах .
> Формат выходных данных
- Программа должна вывести одно число – значение тригонометрического выражения.
+ Примечание 1. Тригонометрические функции принимают аргумент в радианах. Чтобы перевести градусы в радианы, воспользуйтесь формулой r= (180 x) /π
+ Примечание 2. Модуль math содержит встроенную функцию radians(), которая переводит угол из градусов в угол в радианах.

> Для примера:

|Ввод    |Результат
|--------|-----------------
|30.0    |
|        |1.6993587371177719

> Решение:

```
from math import radians, sin, cos, tan
print(sin((x := radians(float(input())))) + cos(x) + tan(x) ** 2)
```
#### Задача 2. Напишите программу, вычисляющую значение ⌈x⌉ +⌊x⌋ по заданному вещественному числу x.
> Формат входных данных
- На вход программе подается одно вещественное число x.
> Формат выходных данных
- Программа должна вывести одно число – значение указанного выражения.

**Примечание.** ⌈x⌉ – потолок числа, ⌊x⌋ – пол числа

> Для примера:

|Ввод    |Результат
|--------|-----------------
|5.5     |
|        |11
|-12.2   |
|        |-25

> Решение:

```
import math
a = float(input())
print(math.ceil(a) + math.floor(a))
```
#### Задача 3. Дано положительное действительное число X. Выведите его дробную часть.
> Входные данные
- Вводятся положительное действительное число.
> Выходные данные
- Выведите ответ на задачу

> Для примера:

|Ввод    |Результат
|--------|-----------------
|17.9    |
|        |0.9

> Решение:

```
a = float(input())
b = a * 10
c = b % 10
d = c / 10
e = round(d, 10)
print (e)
```
#### Задача 4. Даны три вещественных числа a, b, c. Напишите программу, которая находит вещественные корни квадратного уравнения ax + bx + c = 0. 
> Формат входных данных
- На вход программе подается три вещественных числа a , b, c каждое на отдельной строке.
> Формат выходных данных
- Программа должна вывести вещественные корни уравнения если они существуют или текст «Нет корней» в противном случае.<br>
**Примечание.** Если уравнение имеет два корня, то следует вывести их в порядке возрастания.

> Для примера:

|Ввод              |Результат
|------------------|-----------------
|1<br>2<br>1       |
|                  |-1.0
|1<br>-7.5<br>3    |
|                  |0.4239663260874824
|                  |7.076033673912518

> Решение:

```
a = float(input())
b = float(input())
c = float(input())
d = b**2-4*a*c # дискриминант
if d < 0:
    print('Нет корней')
elif d == 0: # если дискриминант == 0 - один корень
    print(-b / (2*a))
elif d > 0: # Если дискриминант > 0 - два корня
    x1 = (-b - d ** 0.5) / (2*a)
    x2 = (-b + d ** 0.5) / (2*a)
    print(min(x1, x2))
    print(max(x1, x2))
```
#### Задача 5. ``Decimal`` числа, разделенные символом пробела, хранятся в строковой переменной ``s``. Дополните приведенный код, чтобы он вывел сумму наибольшего и наименьшего ``Decimal`` числа.

> Для примера:

|Результат
|-----------------
|10.00

> Решение:

```
from decimal import Decimal as D
s = '0.77 4.03 9.06 3.80 7.08 5.88 0.23 4.65 2.79 0.90 4.23 2.15 3.24 8.57 0.10 8.57 1.49 5.64 3.63 8.36 1.56 6.67 1
a = [D(i) for i in s.split()]
print(max(a) + min(a))
```
- альтернативное решение
> Решение:

```
from decimal import Decimal as Dcm
s = '0.77 4.03 9.06 3.80 7.08 5.88 0.23 4.65 2.79 0.90 4.23 2.15 3.24 8.57 0.10 8.57 1.49 5.64 3.63 8.36 1.56 6.67 1
print(Dcm(max(s.split(), key=Dcm)) + Dcm(min(s.split(), key=Dcm)))
```
#### Задача 6. ``Decimal`` числа, разделенные символом пробела, хранятся в строковой переменной ``s``. Дополните приведенный код, чтобы он вывел на первой строке сумму всех чисел, а на второй строке 5 самых больших чисел в порядке убывания, разделенных символом пробела.

> Для примера:

|Результат
|-----------------
|279.12
|9.85 9.74 9.73 9.60 9.36

> Решение:

```
from decimal import Decimal
s = '9.73 8.84 8.92 9.60 9.32 8.97 8.53 1.26 6.62 9.85 1.85 1.80 0.83 6.75 9.74 9.11 9.14 5.03 5.03 1.34 3.52 8.09 7
s = sorted(s.split(), reverse = True)
s_decimals = list(map(Decimal, s))
print(sum(s_decimals))
print(*s_decimals[:5])
```
- альтернативное решение
> Решение:

```
from decimal import Decimal
s = '9.73 8.84 8.92 9.60 9.32 8.97 8.53 1.26 6.62 9.85 1.85 1.80 0.83 6.75 9.74 9.11 9.14 5.03 5.03 1.34 3.52 8.09 7
s_decimals = sorted(map(Decimal, s.split()), reverse=True)
print(sum(s_decimals))
print(*s_decimals[:5])
```
#### Задача 7. Дополните приведенный код, чтобы он вывел сумму наибольшей и наименьшей цифры ``Decimal`` числа.

> Для примера:

|Ввод             |Результат
|-----------------|-----------------
|12.1244354689    |10
|0.1244354689     |9

> Решение:

```
from decimal import *
num = Decimal(input())
arr = [int(elem) for elem in str(num) if elem.isdigit()]
arr.sort()
print(arr[0] + arr[-1])
Ввод
```
#### Задача 8. Десятичные числа хранятся в списке numbers в виде строк. Дополните приведенный код, чтобы он для каждого десятичного числа вывел его представление в виде обыкновенной дроби в формате:
- десятичное число = обыкновенная дробь.

**Примечание.** Программа должна вывести:

|Результат
|-----------------
|6.34 = 317/50
|4.08 = 102/25
|3.04 = 76/25
|7.49 = 749/100
|4.45 = 89/20
|...

> Решение:

```
from fractions import Fraction as F
numbers = ['6.34', '4.08', '3.04', '7.49', '4.45', '5.39', '7.82', '2.76', '0.71', '1.97', '2.54', '3.67', '0.14',
for num in numbers:
print(f"{num} = {F(num)}")
```
#### Задача 9. Десятичные числа, разделенные символом пробела, хранятся в строковой переменной s. Дополните приведенный код, чтобы он вывел сумму наибольшего и наименьшего числа в виде обыкновенной дроби.

> Для примера:

|Результат
|-----------------
|997021/100000

> Решение:

```
from fractions import Fraction
s = '0.78 4.3 9.6 3.88 7.08 5.88 0.23 4.65 2.79 0.90 4.23 2.15 3.24 8.57 0.10 8.57 1.49 5.64 3.63 8.36 1.56 6.67 1.4
s = str(s).split()
print(Fraction(min(s))+ Fraction(max(s)))
```
#### Задача 10. Даны два натуральных числа m и n. Напишите программу, которая сокращает дробь n/m и выводит ее.
> Формат входных данных
- На вход программе подается два натуральных числа, числитель и знаменатель дроби, каждое на отдельной строке.
> Формат выходных данных
- Программа должна вывести ответ на задачу.

> Для примера:

|Ввод             |Результат
|-----------------|-----------------
|3<br>6           |
|                 |1/2
|30<br>2          |
|                 |15

> Решение:

```
from fractions import Fraction
a = int(input())
b = int(input())
print(Fraction(a, b))
```



























