# Тест_02. Циклы.
### P.s. Учитывайте все указанные пробелы, иначе результат может быть другой.

#### Задача 1. На вход программе подается натуральное число. Найдите количество цифр не больше 6 в числе.

> Для примера:

|Ввод    |Результат
|--------|--------------------
|45      |
|        |2

> Решение:
```
n = int(input())
count = 0
while n > 0:
    number = n % 10
    if number <= 6:
        count += 1
    n = n // 10
print(count)
```

#### Задача 2. На вход программе подается 2 натуральных числа. Определите у какого числа сумма цифр больше. В ответе выведите 1 -
если сумма цифр первого числа больше, 2 - если второго, 0 - если сума цифр одинаковая

> Для примера:

|Ввод    |Результат
|--------|-----------
|45      |
|90      |
|        |0

> Решение:

```
a = int(input())
b = int(input())
sa = 0
while a != 0:
    sa += a % 10  # последняя цифра
    a = a // 10  # сократить число
sb=0
while b != 0:
    sb += b % 10
    b = b // 10
if sa > sb:
    print(1)
elif sa < sb:
    print(2)
else:
    print(0)
```

#### Задача 3. На вход программе подается натуральное число. Найдите самую маленькую цифру числа. При решении этой задачи повторите тему поиска минимума.

> Для примера:

|Ввод    |Результат
|--------|-----------
|1111    |
|        |1

> Решение:

```
a = int(input())
m = a % 10
a = a // 10
while a > 0:
    if a % 10 < m:
        m = a % 10
    a = a // 10
print(m)
```

#### Задача 4. На вход программе подается натуральное число. Напишите программу, которая выводит первую цифру числа.

> Для примера:

|Ввод    |Результат
|--------|-----------
|45      |
|        |4

> Решение:

```
n = int(input())
while n > 9:
    n = n // 10
print(n)
```













