# Тест_01. Циклы.
### P.s. Учитывайте все указанные пробелы, иначе результат может быть другой.

#### Задача 1. Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.

> Для примера:

|Ввод    |Результат
|--------|--------------------
|1       |
|10      |
|        |1 2 3 4 5 6 7 8 9 10
|-3      |
|14      |
|        |-3 -2 -1 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14

> Решение:
```
a = int(input())
b = int(input())
for i in range(a, b + 1):
    print(i, end=' ')
```

#### Задача 2. Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

> Входные данные
- Вводятся два целых числа.
> Выходные данные
- Выведите ответ на задачу.

> Для примера:

|Ввод    |Результат
|--------|--------------------
|1       |
|10      |
|        |1 2 3 4 5 6 7 8 9 10
|10      |
|1       |
|        |10 9 8 7 6 5 4 3 2 1

> Решение:
```
a = int(input())
b = int(input())
if a < b:
for i in range(a, b + 1):
print(i, end = ' ')
else:
for i in range(a, b - 1, -1):
print(i, end = ' ')
```

#### Задача 3. Даны два целых числа A и В, A>B. Выведите все нечётные числа от A до B включительно, в порядке убывания. В этой задаче можно обойтись без инструкции if.

> Для примера:

|Ввод    |Результат
|--------|--------------------
|7       |
|1       |
|        |7 5 3 1

> Решение:

```
a = int(input())
b = int(input())
for i in range(a - int((a % 2) == 0), b - 1, -2):
    print(i, end=' ')
```
- альтернативное решение

> Решение:

```
a = int(input())
b = int(input())
for i in range(a - (a + 1) % 2, b - b % 2, -2):
    print(i, end=' ')
```
#### Задача 4. Вводятся целые числа a и b. Гарантируется, что a не превосходит b. Выведите (через пробел) все четные числа от a до b (включительно).

> Для примера:

|Ввод    |Результат
|--------|--------------------
|2       |
|5       |
|        |2 4

> Решение:
```
a = int(input())
b = int(input())
for i in range(a + int(a % 2), b + 1, 2):
    print(i, end=' ')
```
- альтернативное решение

> Решение:

```
a = int(input())
b = int(input())
for i in range(a, b+1):
    if i % 2 == 0:
        print(i, end=' ')
```

#### Задача 5. Напишите программу, которая вводит два целых числа и находит их произведение, не используя операцию умножения.

**``Учтите, что числа могут быть отрицательными.``**

> Входные данные
- Входная строка содержит два целых числа.
> Выходные данные
- Программа должна вывести произведение введённых чисел.

> Для примера:

|Ввод    |Результат
|--------|----------
|6       |
|12      |
|        |7 2
|-7      |
|15      |
|        |-105

> Решение:

```
a = int(input())
b = int(input())
result = 0
for i in range(abs(b)):
    result += abs(a)
print(((result, -result), (-result, result))[a >= 0][b >= 0])
```
- альтернативное решение

> Решение:

```
a = int(input())
b = int(input())
if a > 0 > b:
    a, b = b, a
elif a < 0 and b < 0:
    a = -a
    b = -b
s = 0
for i in range(b):
    s = s + a
print(s)
```

#### Задача 6. Вводятся целые числа a и b. Гарантируется, что a не превосходит b. Выведите все числа на отрезке от a до b, являющиеся полными квадратами. Если таких чисел нет, то ничего выводить не нужно.

|Ввод    |Результат
|--------|----------
|2       |
|8       |
|        |4
|17      |
|164     |
|        |25
|        |36
|        |49
|        |64
|        |81
|        |100
|        |121
|        |144


> Решение:

```
a = int(input())
b = int(input())
from math import sqrt
for i in range(a, b + 1):
    if sqrt(i).is_integer():
        print(i)
```
- альтернативное решение

> Решение:

```
from math import sqrt
a = int(input())
b = int(input())
i = a
while i <= b:
    if sqrt(i).is_integer():
        print(i)
    i += 1
```



