# Тест_05. Циклы. Вопросы.
#### Где объявляют переменную-итератор?
- [ ] a. Не объявляется в цикле for
- [ ] b. В теле цикла for
- [X] c. В заголовке цикла for &check;
- [ ] d. Перед описанием цикла for

> Правильный ответ: **В заголовке цикла for**

#### Циклы нужны, чтобы вызывать одни и те же команды несколько раз. Как называется каждый такой повтор?
- [X] a. Итерацией &check;
- [ ] b. Счётчиком
- [ ] c. Выводом цикла
- [ ] d. Телом цикла

> Правильный ответ: **Итерацией**

#### Цикл выведет на экран несколько чисел. Назовите их, не запуская код.
```
for i in range(10)
print(i)
```
- [ ] a. 0, 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
- [ ] b. 1, 2, 3, 4, 5, 6, 7, 8, 9, 10
- [X] c. 0, 1, 2, 3, 4, 5, 6, 7, 8, 9 &check;
- [ ] d. 1, 2, 3, 4, 5, 6, 7, 8, 9

> Правильный ответ: **0, 1, 2, 3, 4, 5, 6, 7, 8, 9**

#### Где находятся инструкции, которые выполняет цикл?
- [ ] a. В итераторе цикла
- [X] b. В теле цикла &check;
- [ ] c. Вне описания цикла
- [ ] d. В заголовке цикла

> Правильный ответ: **В теле цикла**

#### Сколько инструкций может выполнить цикл за одну итерацию?
- [X] a. Сколько угодно &check;
- [ ] b. Только одну 
- [ ] c. Три или больше
- [ ] d. Не более двух

> Правильный ответ: **Сколько угодно**

#### Для чего используют переменную-счётчик? Выберите один вариант.
- [X] a. Накопить результат вычислений &check;
- [ ] b. Найти количество элементов в списке
- [ ] c. Посчитать количество итераций в цикле 
- [ ] d. Посчитать время выполнения цикла

> Правильный ответ: **Накопить результат вычислений**

#### Можно ли заменить цикл в коде на встроенную функцию Python?
```
import math
fact = 1
for i in range(1, 11):
    fact *= i
```    
- [ ] a. Да, можно — на sum()
- [ ] b. Да, можно — на max()
- [ ] c. Нет, нельзя
- [X] d. Да, можно — на math.factorial() &check;

> Правильный ответ: **Да, можно — на math.factorial()**

#### Что выведет программа?
```
for i in range(5):
    if i % 2 == 0:
      continue
    print(i)
 ```   
- [ ] a. Ошибку, так как i не присвоена
- [ ] b. Числа: 0, 2 и 4
- [ ] c. Числа: 1, 3 и 5
- [X] d. Числа: 1 и 3 &check;
- [ ] e. Ошибку из-за неверного вывода

> Правильный ответ: **Числа: 1 и 3**

#### Что выведет программа?
```
s = ""
n = 5
while n > 0:
      n -= 1
      if (n % 2) == 0:
          continue
      print(n)
```
- [ ] a. Ничего
- [ ] b. 0
- [X] c. 3<br>
&nbsp;&nbsp;&nbsp;1

> Правильный ответ:<br>
**3<br>
1**

#### Какое будет значение i после исполнения инструкций?
```
i, n = 0, 625
while n > 0:
    n = n // 5
    i = i + 1
print(i)
```      
- [X] a. 5 &check;
- [ ] b. 1
- [ ] c. 6
- [ ] d. 0

> Правильный ответ: **5**

#### Какое число нужно написать вместо многоточия, чтобы цикл выполнился ровно 3 раза?
```
i = 2
while i <= ...:
    print("Привет!")
    i += 1
print(i)
```    
- [ ] a. 3
- [ ] b. 2
- [X] c. 4 &check;
- [ ] d. 5

> Правильный ответ: **4**

#### Что выведет программа?
```
i = 1
while True:
    if i % 3 == 0:
        break
    print(i)
    i += 1
```
- [X] a. 1<br>
&nbsp;&nbsp;&nbsp;2 &check;
- [ ] b. Ничего
- [ ] c. 1
- [ ] d. 1<br>
&nbsp;&nbsp;&nbsp;2<br>
&nbsp;&nbsp;&nbsp;3

> Правильный ответ: **12**

#### Сколько раз будет выполнен этот цикл?
```
i = 3
while i < 7:
      print ( "Привет!" )
      i += 1
```
- [ ] a. 3
- [ ] b. 5
- [X] c. 4 &check;
- [ ] d. 7

> Правильный ответ: **4**

#### Какое число будет выведено на экран в результате выполнения этого цикла?
```
i = 3
print ("9", end="")
while i < 6:
      print (i, end="")
      i += 1
```
- [ ] a. 6
- [ ] b. 9
- [ ] c. 9123
- [X] d. 9345 &check; 

> Правильный ответ: **9345**

#### Чему будет равно значение переменной «a» после выполнения этого цикла?
```
i = 4
a = 12
while i < 5:
      a += i
      i += 1
      print (i)
```
- [ ] a. 15
- [X] b. 16 &check;
- [ ] c. 12

Правильный ответ: 16

#### Цикл с предусловием – это цикл, который:
- [ ] a. Повторяется до тех пор, пока условие ложное
- [ ] b. Повторяется определенное число раз
- [X] c. Повторяется до тех пор, пока условие верное &check;

> Правильный ответ: **Повторяется до тех пор, пока условие верное**

#### Что будет на выходе из следующего кода Python?
```
i = 1
while True:
    if i % 007 == 0:
    break
    print(i)
    i += 1
```
- [ ] a. ничего
- [ ] b. ошибка
- [ ] c. 12345
- [X] d. 123456 &check;

> Правильный ответ: **123456**
