# Тест_01. Циклы.

#### Задача 1. Даны два целых числа A и B (при этом A ≤ B). Выведите все числа от A до B включительно.

> Для примера:

|Ввод    |Результат
|--------|--------------------
|1       |1
|1       |10
|        |1 2 3 4 5 6 7 8 9 10
|-3      |14
|        |-3 -2 -1 0 1 2 3 4 5 6 7 8 9 10 11 12 13 14
> Решение:
```
a = int(input())
b = int(input())
for i in range(a, b + 1):
    print(i, end=' ')
```

#### Задача 2. Даны два целых числа A и В. Выведите все числа от A до B включительно, в порядке возрастания, если A < B, или в порядке убывания в противном случае.

> Входные данные
- Вводятся два целых числа.
> Выходные данные
- Выведите ответ на задачу.

> Для примера:

|Ввод    |Результат
|--------|--------------------
|1       |1
|1       |10
|        |1 2 3 4 5 6 7 8 9 10
|10      |1
|        |10 9 8 7 6 5 4 3 2 1

> Решение:
```
a = int(input())
b = int(input())
if a < b:
for i in range(a, b + 1):
print(i, end = ' ')
else:
for i in range(a, b - 1, -1):
print(i, end = ' ')
```






















